package com.neuedu.tes4.chaper3;

public class test28 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        /*5.企业发放的奖金根据利润提成
         * 。利润低于或等于10万元时，
         * 奖金可提10%；利润高于10万元，
         * 低于20万元时，低于10万元的部分按10%提成
         * ，高于10万元的部分，可提成7.5%；20万到40万之间时
         * ，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分
         * ，可提成3%；60万到100万之间时，
         * 高于60万元的部分，可提成1.5%，高于100万元时
         * ，超过100万元的部分按1%提成，
         * 在程序中设定一个变量为当月利润，求应发放奖金总数？
         *
         * */
		
		 double A=1500000;//利润
		 double B=0;//奖金
		 if(A<=100000)
		 {
			 B = A*0.1;
			 System.out.println(B);
		 }
		 else
			 if(A>100000 && A<=200000)
		 {
			 B = 100000*0.1+((A-100000)*0.075);
			 System.out.println(B);
		 }
			 else if(A>200000 && A<=400000)
			 {
				 B = 100000*0.1+100000*0.075+((A-200000)*0.05);
				 System.out.println(B);
			 }
			 else if(A>400000 && A<600000)
			 {
				 B = 100000*0.1+100000*0.075+200000*0.05+((A-400000)*0.03);
				 System.out.println(B);
			 }
			 else if(A>600000 && A<=1000000)
			 {
				 B = 100000*0.1+100000*0.075+200000*0.05+200000*0.03+
						 ((A-600000)*0.015);
				 System.out.println(B);
			 }
			 else if(A>1000000)
			 {
				 B = 100000*0.1+100000*0.075+200000*0.05+200000*0.03+400000*0.015+((A-1000000)*0.01);
				 System.out.println(B);
			 }
				 
	}

}
